{
    "messages": [
        {
            "id": "welcome_v2",
            "title": "춰Bienvenido a EspaDaily!",
            "text": "EspaDaily combina la navegaci칩n por cat치logos de TV espa침ola con un buscador universal de v칤deo, localizando listas p칰blicas de plataformas como Atresplayer, RTVE Play y Mediaset.\n\n游빌 Caracter칤sticas:\n- Explorador Unificado: Series, Programas y Documentales en una interfaz.\n- Buscador Universal: Encuentra pel칤culas y v칤deos en la red.\n- Integraci칩n Palantir: M치s resultados y calidad.\n- Cach칠 H칤brida: Navegaci칩n ultra r치pida.\n- Backups y Descargas: Portabilidad y modo offline.\n- Gesti칩n Avanzada: Favoritos e Historial.\n- Privacidad: Sin publicidad ni trackers ni virus.\n\n丘멆잺 Aviso Importante:\nEste addon NO aloja contenido. Es un mero buscador y NO tiene relaci칩n con ninguna entidad oficial. El usuario es responsable de su uso.\n\nInfo: https://github.com/fullstackcurso/espadaily",
            "color": "yellow",
            "date": "2026-01-04"
        },
        {
            "id": "tip_palantir_v2",
            "title": "Integraci칩n con Palantir 3",
            "text": "Ahora puedes activar la opci칩n de 'Buscar en Palantir' desde los ajustes avanzados para encontrar m치s resultados y mejores calidades si tienes ese addon instalado.\n\nNota: Se ha detectado que esta integraci칩n no funciona correctamente con la skin Estuary Palantir.",
            "color": "cyan",
            "date": "2026-01-04"
        },
        {
            "id": "roadmap_v1",
            "title": "Pr칩ximas Mejoras y Notas",
            "text": "Cosas a mejorar en la pr칩xima versi칩n:\n\n-Cuando no se encuentra un video en Palantir autom치ticamente preguntar si deseas editar la b칰squeda.\n-La opci칩n de editar las palabras clave y buscar ha dejado de funcionar en el historial de exploraci칩n. Poner esa opci칩n en m치s sitios.\n-Mas integraciones.\n-Mas listas personalizadas como la de Mejores..\n-Poner mensaje de que la integraci칩n con Palantir se ha probado con la Skin Estuary, y que se cree que no funciona en otras como Estuary Palantir.\n-Hacer v칤deo explicativo de instalaci칩n, otro de uso y un Telegra.ph.\n\nM치s info: https://t.me/espadaily",
            "color": "green",
            "date": "2026-01-04"
        }
    ]
}
